MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/component/dmt.h
#define DMT_DMTHOLDREGCLR_Msk                 _UINT32_(0x00000000)                                 /* (DMT_DMTHOLDREGCLR) Register Mask  */


/* -------- DMT_DMTHOLDREGSET : (DMT Offset: 0x58) (R/W 32) Bit set register -------- */
#define DMT_DMTHOLDREGSET_RESETVALUE          _UINT32_(0x00)                                       /*  (DMT_DMTHOLDREGSET) Bit set register  Reset Value */

#define DMT_DMTHOLDREGSET_Msk                 _UINT32_(0x00000000)                                 /* (DMT_DMTHOLDREGSET) Register Mask  */


/* -------- DMT_DMTHOLDREGINV : (DMT Offset: 0x5C) (R/W 32) Bit invert register -------- */
#define DMT_DMTHOLDREGINV_RESETVALUE          _UINT32_(0x00)                                       /*  (DMT_DMTHOLDREGINV) Bit invert register  Reset Value */

#define DMT_DMTHOLDREGINV_Msk                 _UINT32_(0x00000000)                                 /* (DMT_DMTHOLDREGINV) Register Mask  */


/* -------- DMT_DMTPSCNT : (DMT Offset: 0x60) (R/W 32)  -------- */
#define DMT_DMTPSCNT_RESETVALUE               _UINT32_(0x00)                                       /*  (DMT_DMTPSCNT)   Reset Value */

#define DMT_DMTPSCNT_PSCNT_Pos                _UINT32_(0)                                          /* (DMT_DMTPSCNT)  Position */
#define DMT_DMTPSCNT_PSCNT_Msk                (_UINT32_(0xFFFFFFFF) << DMT_DMTPSCNT_PSCNT_Pos)     /* (DMT_DMTPSCNT)  Mask */
#define DMT_DMTPSCNT_PSCNT(value)             (DMT_DMTPSCNT_PSCNT_Msk & (_UINT32_(value) << DMT_DMTPSCNT_PSCNT_Pos)) /* Assigment of value for PSCNT in the DMT_DMTPSCNT register */
#define DMT_DMTPSCNT_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (DMT_DMTPSCNT) Register Mask  */


/* -------- DMT_DMTPSCNTCLR : (DMT Offset: 0x64) (R/W 32) Bit clear register -------- */
#define DMT_DMTPSCNTCLR_RESETVALUE            _UINT32_(0x00)                                       /*  (DMT_DMTPSCNTCLR) Bit clear register  Reset Value */

#define DMT_DMTPSCNTCLR_Msk                   _UINT32_(0x00000000)                                 /* (DMT_DMTPSCNTCLR) Register Mask  */


/* -------- DMT_DMTPSCNTSET : (DMT Offset: 0x68) (R/W 32) Bit set register -------- */
#define DMT_DMTPSCNTSET_RESETVALUE            _UINT32_(0x00)                                       /*  (DMT_DMTPSCNTSET) Bit set register  Reset Value */

#define DMT_DMTPSCNTSET_Msk                   _UINT32_(0x00000000)                                 /* (DMT_DMTPSCNTSET) Register Mask  */


/* -------- DMT_DMTPSCNTINV : (DMT Offset: 0x6C) (R/W 32) Bit invert register -------- */
#define DMT_DMTPSCNTINV_RESETVALUE            _UINT32_(0x00)                                       /*  (DMT_DMTPSCNTINV) Bit invert register  Reset Value */

#define DMT_DMTPSCNTINV_Msk                   _UINT32_(0x00000000)                                 /* (DMT_DMTPSCNTINV) Register Mask  */


/* -------- DMT_DMTPSINTV : (DMT Offset: 0x70) (R/W 32)  -------- */
#define DMT_DMTPSINTV_RESETVALUE              _UINT32_(0x00)                                       /*  (DMT_DMTPSINTV)   Reset Value */

#define DMT_DMTPSINTV_PSINTV_Pos              _UINT32_(0)                                          /* (DMT_DMTPSINTV)  Position */
#define DMT_DMTPSINTV_PSINTV_Msk              (_UINT32_(0xFFFFFFFF) << DMT_DMTPSINTV_PSINTV_Pos)   /* (DMT_DMTPSINTV)  Mask */
#define DMT_DMTPSINTV_PSINTV(value)           (DMT_DMTPSINTV_PSINTV_Msk & (_UINT32_(value) << DMT_DMTPSINTV_PSINTV_Pos)) /* Assigment of value for PSINTV in the DMT_DMTPSINTV register */
#define DMT_DMTPSINTV_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (DMT_DMTPSINTV) Register Mask  */


/* -------- DMT_DMTPSINTVCLR : (DMT Offset: 0x74) (R/W 32) Bit clear register -------- */
#define DMT_DMTPSINTVCLR_RESETVALUE           _UINT32_(0x00)                                       /*  (DMT_DMTPSINTVCLR) Bit clear register  Reset Value */

#define DMT_DMTPSINTVCLR_Msk                  _UINT32_(0x00000000)                                 /* (DMT_DMTPSINTVCLR) Register Mask  */


/* -------- DMT_DMTPSINTVSET : (DMT Offset: 0x78) (R/W 32) Bit set register -------- */
#define DMT_DMTPSINTVSET_RESETVALUE           _UINT32_(0x00)                                       /*  (DMT_DMTPSINTVSET) Bit set register  Reset Value */

#define DMT_DMTPSINTVSET_Msk                  _UINT32_(0x00000000)                                 /* (DMT_DMTPSINTVSET) Register Mask  */


/* -------- DMT_DMTPSINTVINV : (DMT Offset: 0x7C) (R/W 32) Bit invert register -------- */
#define DMT_DMTPSINTVINV_RESETVALUE           _UINT32_(0x00)                                       /*  (DMT_DMTPSINTVINV) Bit invert register  Reset Value */

#define DMT_DMTPSINTVINV_Msk                  _UINT32_(0x00000000)                                 /* (DMT_DMTPSINTVINV) Register Mask  */


/** \brief DMT register offsets definitions */
#define DMT_DMTCON_REG_OFST            _UINT32_(0x00)      /* (DMT_DMTCON)  Offset */
#define DMT_DMTCONCLR_REG_OFST         _UINT32_(0x04)      /* (DMT_DMTCONCLR) Bit clear register Offset */
#define DMT_DMTCONSET_REG_OFST         _UINT32_(0x08)      /* (DMT_DMTCONSET) Bit set register Offset */
#define DMT_DMTCONINV_REG_OFST         _UINT32_(0x0C)      /* (DMT_DMTCONINV) Bit invert register Offset */
#define DMT_DMTPRECLR_REG_OFST         _UINT32_(0x10)      /* (DMT_DMTPRECLR)  Offset */
#define DMT_DMTPRECLRCLR_REG_OFST      _UINT32_(0x14)      /* (DMT_DMTPRECLRCLR) Bit clear register Offset */
#define DMT_DMTPRECLRSET_REG_OFST      _UINT32_(0x18)      /* (DMT_DMTPRECLRSET) Bit set register Offset */
#define DMT_DMTPRECLRINV_REG_OFST      _UINT32_(0x1C)      /* (DMT_DMTPRECLRINV) Bit invert register Offset */
#define DMT_DMTCLR_REG_OFST            _UINT32_(0x20)      /* (DMT_DMTCLR)  Offset */
#define DMT_DMTCLRCLR_REG_OFST         _UINT32_(0x24)      /* (DMT_DMTCLRCLR) Bit clear register Offset */
#define DMT_DMTCLRSET_REG_OFST         _UINT32_(0x28)      /* (DMT_DMTCLRSET) Bit set register Offset */
#define DMT_DMTCLRINV_REG_OFST         _UINT32_(0x2C)      /* (DMT_DMTCLRINV) Bit invert register Offset */
#define DMT_DMTSTAT_REG_OFST           _UINT32_(0x30)      /* (DMT_DMTSTAT)  Offset */
#define DMT_DMTSTATCLR_REG_OFST        _UINT32_(0x34)      /* (DMT_DMTSTATCLR) Bit clear register Offset */
#define DMT_DMTSTATSET_REG_OFST        _UINT32_(0x38)      /* (DMT_DMTSTATSET) Bit set register Offset */
#define DMT_DMTSTATINV_REG_OFST        _UINT32_(0x3C)      /* (DMT_DMTSTATINV) Bit invert register Offset */
#define DMT_DMTCNT_REG_OFST            _UINT32_(0x40)      /* (DMT_DMTCNT)  Offset */
#define DMT_DMTCNTCLR_REG_OFST         _UINT32_(0x44)      /* (DMT_DMTCNTCLR) Bit clear register Offset */
#define DMT_DMTCNTSET_REG_OFST         _UINT32_(0x48)      /* (DMT_DMTCNTSET) Bit set register Offset */
#define DMT_DMTCNTINV_REG_OFST         _UINT32_(0x4C)      /* (DMT_DMTCNTINV) Bit invert register Offset */
#define DMT_DMTHOLDREG_REG_OFST        _UINT32_(0x50)      /* (DMT_DMTHOLDREG)  Offset */
#define DMT_DMTHOLDREGCLR_REG_OFST     _UINT32_(0x54)      /* (DMT_DMTHOLDREGCLR) Bit clear register Offset */
#define DMT_DMTHOLDREGSET_REG_OFST     _UINT32_(0x58)      /* (DMT_DMTHOLDREGSET) Bit set register Offset */
#define DMT_DMTHOLDREGINV_REG_OFST     _UINT32_(0x5C)      /* (DMT_DMTHOLDREGINV) Bit invert register Offset */
#define DMT_DMTPSCNT_REG_OFST          _UINT32_(0x60)      /* (DMT_DMTPSCNT)  Offset */
#define DMT_DMTPSCNTCLR_REG_OFST       _UINT32_(0x64)      /* (DMT_DMTPSCNTCLR) Bit clear register Offset */
#define DMT_DMTPSCNTSET_REG_OFST       _UINT32_(0x68)      /* (DMT_DMTPSCNTSET) Bit set register Offset */
#define DMT_DMTPSCNTINV_REG_OFST       _UINT32_(0x6C)      /* (DMT_DMTPSCNTINV) Bit invert register Offset */
#define DMT_DMTPSINTV_REG_OFST         _UINT32_(0x70)      /* (DMT_DMTPSINTV)  Offset */
#define DMT_DMTPSINTVCLR_REG_OFST      _UINT32_(0x74)      /* (DMT_DMTPSINTVCLR) Bit clear register Offset */
#define DMT_DMTPSINTVSET_REG_OFST      _UINT32_(0x78)      /* (DMT_DMTPSINTVSET) Bit set register Offset */
#define DMT_DMTPSINTVINV_REG_OFST      _UINT32_(0x7C)      /* (DMT_DMTPSINTVINV) Bit invert register Offset */

